Tekla Open API Reference for Tekla Structures 2025
MeshItemEnumerator.SelectMeshItem Method
 Selects a mesh item in the mesh database with the given name and grade.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static MeshItem SelectMeshItem(
	string Name,
	string Grade
)
Public Shared Function SelectMeshItem (
	Name As String,
	Grade As String
) As MeshItem
Parameters
Name
Type: System.String
The name of the mesh item to select.
Grade
Type: System.String
The grade of the mesh item to select.
Return Value
Type: MeshItem
The first MeshItem that matches the conditions.
See Also
Reference
MeshItemEnumerator Class
Tekla.Structures.Catalogs Namespace